In [50]:
import pandas as pd
#Define a dictionary 'x'

x = {'Name': ['Rose','John', 'Jane', 'Mary'],
     'ID': [1, 2, 3, 4],
     'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'],
     'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [120]:
x = df[['Name']]
x

   Name
0  Rose
1  John
2  Jane
3  Mary

In [68]:
type(x)

pandas.core.frame.DataFrame

In [71]:
z = df[['Salary', 'Department', 'ID']]
z

   Salary       Department  ID
0  100000  Architect Group   1
1   80000   Software Group   2
2   50000      Design Team   3
3   60000   Infrastructure   4

In [73]:
a = {'Student' : ['David', 'Samuel', 'Terry', 'Evan'], 
     'Age' : [27, 24, 22, 32], 
     'Country' : ['UK', 'Canada', 'China', 'USA'], 
     'Course' : ['Python', 'Data Structures', 'Machine Learning', 'Web Development'], 
     'Marks' : [85, 72, 89, 76]}
df1 = pd.DataFrame(a)
df1

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA   Web Development     76

In [95]:
b = df1[['Marks']]
b

   Marks
0     85
1     72
2     89
3     76

In [96]:
c = df1[['Country', 'Course']]
c

  Country            Course
0      UK            Python
1  Canada   Data Structures
2   China  Machine Learning
3     USA   Web Development

In [126]:
x = df1['Student']
x

0     David
1    Samuel
2     Terry
3      Evan
Name: Student, dtype: object

In [100]:
type(x)

pandas.core.series.Series

In [106]:
q = df.iloc[0, 0]
print(q)
w = df.iloc[0, 2]
print(w)
r = df.loc[0, 'Salary']
print(r)

Rose
Architect Group
100000

In [128]:
df2 = df
df2 = df2.set_index('Name')
df2.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [131]:
t = df2.loc['Jane','Department']
t

'Design Team'

In [159]:
df2.iloc[3, 2]

np.int64(60000)

In [174]:
df.iloc[0:0, 0:]

Empty DataFrame
Columns: [Name, ID, Department, Salary]
Index: []

In [166]:
df.loc[0:2, 'ID':'Department']

   ID       Department
0   1  Architect Group
1   2   Software Group
2   3      Design Team

In [170]:
df2.loc['John':'John', 'Department':'Salary']

          Department  Salary
Name
John  Software Group   80000